
import React from 'react';
import PolicyPage from '../components/PolicyPage';

const PrivacyPage: React.FC = () => {
    return (
        <PolicyPage title="سياسة الخصوصية">
             <p>في Reptile House، نحن نحترم خصوصيتك ونلتزم بحماية بياناتك الشخصية. توضح هذه السياسة كيفية جمعنا واستخدامنا وحمايتنا لمعلوماتك.</p>
            <h2>المعلومات التي نجمعها</h2>
            <p>نقوم بجمع المعلومات التي تقدمها لنا مباشرة، مثل اسمك وبريدك الإلكتروني وعنوانك عند إنشاء حساب أو إجراء عملية شراء.</p>
            <h2>كيف نستخدم معلوماتك</h2>
            <p>نستخدم معلوماتك لمعالجة طلباتك، والتواصل معك، وتحسين خدماتنا. لن نشارك معلوماتك الشخصية مع أطراف ثالثة لأغراض تسويقية دون موافقتك.</p>
        </PolicyPage>
    );
};

export default PrivacyPage;
